sql/URLShortener/app/models/shortened_url.rb

  def self.random_code
    loop do
      random_code = SecureRandom.urlsafe_base64(16)
      return random_code unless ShortenedUrl.exists?(short_url: random_code)
---
SELECT 1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "hVzU8EfDxVEdZ54APlUF6g"], ["LIMIT", 1]]

  def self.create_for_user_and_long_url!(user, long_url)
    ShortenedUrl.create!(
      submitter_id: user.id,
      long_url: long_url,
      short_url: ShortenedUrl.random_code
    )
---
INSERT INTO "shortened_urls" ("long_url", "short_url", "submitter_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "http://www.appacademy.io"], ["short_url", "hVzU8EfDxVEdZ54APlUF6g"], ["submitter_id", 1], ["created_at", "2020-08-31 02:33:29.902518"], ["updated_at", "2020-08-31 02:33:29.902518"]]